WordPress/499/Reports/WP_499_HTMLreports_Concurrent_10threads_DISABLED_4tests/statistics.json
{
  "Add Comment-0" : {
    "transaction" : "Add Comment-0",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28497.5,
    "minResTime" : 26907.0,
    "maxResTime" : 29575.0,
    "pct1ResTime" : 29459.5,
    "pct2ResTime" : 29575.0,
    "pct3ResTime" : 29575.0,
    "throughput" : 0.03422496497288741,
    "receivedKBytesPerSec" : 0.013636509481384828,
    "sentKBytesPerSec" : 0.03205248184472561
  },
  "Add Comment-1" : {
    "transaction" : "Add Comment-1",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 33309.6875,
    "minResTime" : 31851.0,
    "maxResTime" : 35463.0,
    "pct1ResTime" : 34999.6,
    "pct2ResTime" : 35463.0,
    "pct3ResTime" : 35463.0,
    "throughput" : 0.034013966985193295,
    "receivedKBytesPerSec" : 2.3724617409304947,
    "sentKBytesPerSec" : 0.026673062001084196
  },
  "LOG IN" : {
    "transaction" : "LOG IN",
    "sampleCount" : 154,
    "errorCount" : 14,
    "errorPct" : 9.090909,
    "meanResTime" : 65639.2987012987,
    "minResTime" : 12557.0,
    "maxResTime" : 92278.0,
    "pct1ResTime" : 87863.5,
    "pct2ResTime" : 89520.5,
    "pct3ResTime" : 92010.15,
    "throughput" : 0.20670530534668774,
    "receivedKBytesPerSec" : 5.733525371146758,
    "sentKBytesPerSec" : 0.35836426013258665
  },
  "PostTitle" : {
    "transaction" : "PostTitle",
    "sampleCount" : 41,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 33208.34146341463,
    "minResTime" : 28046.0,
    "maxResTime" : 36062.0,
    "pct1ResTime" : 34508.0,
    "pct2ResTime" : 35122.3,
    "pct3ResTime" : 36062.0,
    "throughput" : 0.0632629160501104,
    "receivedKBytesPerSec" : 0.03804906376670488,
    "sentKBytesPerSec" : 0.09293398312191689
  },
  "CheckPublishedPost" : {
    "transaction" : "CheckPublishedPost",
    "sampleCount" : 31,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 31642.451612903224,
    "minResTime" : 29601.0,
    "maxResTime" : 33559.0,
    "pct1ResTime" : 33294.8,
    "pct2ResTime" : 33464.8,
    "pct3ResTime" : 33559.0,
    "throughput" : 0.06291810092875236,
    "receivedKBytesPerSec" : 3.8518943422419953,
    "sentKBytesPerSec" : 0.043904323767414107
  },
  "Log In TRANSACTION" : {
    "transaction" : "Log In TRANSACTION",
    "sampleCount" : 73,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 91064.32876712333,
    "minResTime" : 17016.0,
    "maxResTime" : 119839.0,
    "pct1ResTime" : 116359.20000000001,
    "pct2ResTime" : 118372.3,
    "pct3ResTime" : 119839.0,
    "throughput" : 0.10120348971814135,
    "receivedKBytesPerSec" : 2.90163559092787,
    "sentKBytesPerSec" : 0.19570945075965004
  },
  "GetNewPostPage" : {
    "transaction" : "GetNewPostPage",
    "sampleCount" : 42,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 46561.42857142857,
    "minResTime" : 18712.0,
    "maxResTime" : 62673.0,
    "pct1ResTime" : 61516.0,
    "pct2ResTime" : 62046.4,
    "pct3ResTime" : 62673.0,
    "throughput" : 0.06159748682253764,
    "receivedKBytesPerSec" : 4.624007955058767,
    "sentKBytesPerSec" : 0.07250251064756558
  },
  "PostBody-0" : {
    "transaction" : "PostBody-0",
    "sampleCount" : 40,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 33155.049999999996,
    "minResTime" : 30684.0,
    "maxResTime" : 37158.0,
    "pct1ResTime" : 35615.9,
    "pct2ResTime" : 35758.55,
    "pct3ResTime" : 37158.0,
    "throughput" : 0.06504657334651612,
    "receivedKBytesPerSec" : 0.031495817606969095,
    "sentKBytesPerSec" : 0.13685665635813993
  },
  "Add Comment" : {
    "transaction" : "Add Comment",
    "sampleCount" : 51,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 38595.784313725475,
    "minResTime" : 26263.0,
    "maxResTime" : 64581.0,
    "pct1ResTime" : 62109.2,
    "pct2ResTime" : 64022.6,
    "pct3ResTime" : 64581.0,
    "throughput" : 0.10166856049279349,
    "receivedKBytesPerSec" : 2.2592481323385765,
    "sentKBytesPerSec" : 0.10135318237545601
  },
  "PostBody-1" : {
    "transaction" : "PostBody-1",
    "sampleCount" : 40,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 31261.350000000017,
    "minResTime" : 12967.0,
    "maxResTime" : 41714.0,
    "pct1ResTime" : 40550.4,
    "pct2ResTime" : 40869.55,
    "pct3ResTime" : 41714.0,
    "throughput" : 0.06905755429218596,
    "receivedKBytesPerSec" : 5.130033823634776,
    "sentKBytesPerSec" : 0.0647465150752641
  },
  "POST new user-0" : {
    "transaction" : "POST new user-0",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 37219.83333333332,
    "minResTime" : 29251.0,
    "maxResTime" : 44809.0,
    "pct1ResTime" : 44443.3,
    "pct2ResTime" : 44656.1,
    "pct3ResTime" : 44809.0,
    "throughput" : 0.04619556430191573,
    "receivedKBytesPerSec" : 0.021067703641596335,
    "sentKBytesPerSec" : 0.06782717864055693
  },
  "AddPost TRANSACTION" : {
    "transaction" : "AddPost TRANSACTION",
    "sampleCount" : 31,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 180439.19354838712,
    "minResTime" : 152651.0,
    "maxResTime" : 188251.0,
    "pct1ResTime" : 186048.0,
    "pct2ResTime" : 187137.4,
    "pct3ResTime" : 188251.0,
    "throughput" : 0.04807423903131959,
    "receivedKBytesPerSec" : 9.019635297773387,
    "sentKBytesPerSec" : 0.3083148273359428
  },
  "POST new user-1" : {
    "transaction" : "POST new user-1",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 30339.1,
    "minResTime" : 10088.0,
    "maxResTime" : 38835.0,
    "pct1ResTime" : 38034.8,
    "pct2ResTime" : 38641.95,
    "pct3ResTime" : 38835.0,
    "throughput" : 0.049390358343513234,
    "receivedKBytesPerSec" : 1.3387841853307345,
    "sentKBytesPerSec" : 0.05373130780729858
  },
  "GetNewPostPage-0" : {
    "transaction" : "GetNewPostPage-0",
    "sampleCount" : 17,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 31372.0,
    "minResTime" : 21830.0,
    "maxResTime" : 33939.0,
    "pct1ResTime" : 33855.0,
    "pct2ResTime" : 33939.0,
    "pct3ResTime" : 33939.0,
    "throughput" : 0.031221074592656804,
    "receivedKBytesPerSec" : 0.014695857376621659,
    "sentKBytesPerSec" : 0.022886726383093605
  },
  "GetNewPostPage-1" : {
    "transaction" : "GetNewPostPage-1",
    "sampleCount" : 17,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28259.0,
    "minResTime" : 26304.0,
    "maxResTime" : 29155.0,
    "pct1ResTime" : 29110.2,
    "pct2ResTime" : 29155.0,
    "pct3ResTime" : 29155.0,
    "throughput" : 0.03125419403706747,
    "receivedKBytesPerSec" : 0.15324932447276932,
    "sentKBytesPerSec" : 0.02247831510478428
  },
  "AddUser" : {
    "transaction" : "AddUser",
    "sampleCount" : 23,
    "errorCount" : 11,
    "errorPct" : 47.826088,
    "meanResTime" : 117277.8695652174,
    "minResTime" : 90644.0,
    "maxResTime" : 123480.0,
    "pct1ResTime" : 123030.4,
    "pct2ResTime" : 123414.0,
    "pct3ResTime" : 123480.0,
    "throughput" : 0.03617620643716271,
    "receivedKBytesPerSec" : 1.6229065232384938,
    "sentKBytesPerSec" : 0.15073060945504477
  },
  "PostBody" : {
    "transaction" : "PostBody",
    "sampleCount" : 40,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 64417.95,
    "minResTime" : 44758.0,
    "maxResTime" : 78034.0,
    "pct1ResTime" : 75266.9,
    "pct2ResTime" : 77254.29999999999,
    "pct3ResTime" : 78034.0,
    "throughput" : 0.0652392322647147,
    "receivedKBytesPerSec" : 4.877973711239741,
    "sentKBytesPerSec" : 0.19842856528326874
  },
  "LOG IN-2" : {
    "transaction" : "LOG IN-2",
    "sampleCount" : 48,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25919.041666666668,
    "minResTime" : 3330.0,
    "maxResTime" : 30840.0,
    "pct1ResTime" : 28726.8,
    "pct2ResTime" : 29026.6,
    "pct3ResTime" : 30840.0,
    "throughput" : 0.07106384049721,
    "receivedKBytesPerSec" : 0.35281652695096155,
    "sentKBytesPerSec" : 0.04634070262891795
  },
  "LOG IN-0" : {
    "transaction" : "LOG IN-0",
    "sampleCount" : 154,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25929.571428571424,
    "minResTime" : 4313.0,
    "maxResTime" : 30382.0,
    "pct1ResTime" : 29197.5,
    "pct2ResTime" : 29404.75,
    "pct3ResTime" : 30292.35,
    "throughput" : 0.22050495635004158,
    "receivedKBytesPerSec" : 0.2459147071794409,
    "sentKBytesPerSec" : 0.15470975408685889
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1171,
    "errorCount" : 29,
    "errorPct" : 2.4765158,
    "meanResTime" : 37598.514944491944,
    "minResTime" : 3330.0,
    "maxResTime" : 92278.0,
    "pct1ResTime" : 63437.8,
    "pct2ResTime" : 73896.19999999997,
    "pct3ResTime" : 88285.56,
    "throughput" : 1.5456827799586588,
    "receivedKBytesPerSec" : 32.97657256475764,
    "sentKBytesPerSec" : 1.7667181605516937
  },
  "LOG IN-1" : {
    "transaction" : "LOG IN-1",
    "sampleCount" : 154,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 31629.55844155845,
    "minResTime" : 7246.0,
    "maxResTime" : 37225.0,
    "pct1ResTime" : 36034.5,
    "pct2ResTime" : 36482.25,
    "pct3ResTime" : 37104.549999999996,
    "throughput" : 0.2202151816918246,
    "receivedKBytesPerSec" : 5.521891212270275,
    "sentKBytesPerSec" : 0.18252070371262777
  },
  "POST new user" : {
    "transaction" : "POST new user",
    "sampleCount" : 30,
    "errorCount" : 15,
    "errorPct" : 50.0,
    "meanResTime" : 67560.09999999999,
    "minResTime" : 39339.0,
    "maxResTime" : 82601.0,
    "pct1ResTime" : 81812.5,
    "pct2ResTime" : 82402.45,
    "pct3ResTime" : 82601.0,
    "throughput" : 0.0462182673079708,
    "receivedKBytesPerSec" : 1.2738789566688338,
    "sentKBytesPerSec" : 0.11814093230333356
  },
  "GET user-new PAGE-0" : {
    "transaction" : "GET user-new PAGE-0",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 31720.4375,
    "minResTime" : 22093.0,
    "maxResTime" : 32969.0,
    "pct1ResTime" : 32898.3,
    "pct2ResTime" : 32969.0,
    "pct3ResTime" : 32969.0,
    "throughput" : 0.02570351318831197,
    "receivedKBytesPerSec" : 0.012098723981217158,
    "sentKBytesPerSec" : 0.027887307765834573
  },
  "GET LogIn Page" : {
    "transaction" : "GET LogIn Page",
    "sampleCount" : 157,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 24862.45222929936,
    "minResTime" : 4449.0,
    "maxResTime" : 29917.0,
    "pct1ResTime" : 28812.8,
    "pct2ResTime" : 29187.5,
    "pct3ResTime" : 29882.78,
    "throughput" : 0.22732406275881642,
    "receivedKBytesPerSec" : 1.1257736099386948,
    "sentKBytesPerSec" : 0.12950294172902393
  },
  "GET user-new PAGE-1" : {
    "transaction" : "GET user-new PAGE-1",
    "sampleCount" : 16,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28229.874999999996,
    "minResTime" : 26491.0,
    "maxResTime" : 29856.0,
    "pct1ResTime" : 29438.100000000002,
    "pct2ResTime" : 29856.0,
    "pct3ResTime" : 29856.0,
    "throughput" : 0.025958434057465486,
    "receivedKBytesPerSec" : 0.1272825169946623,
    "sentKBytesPerSec" : 0.025704933724873046
  },
  "GET user-new PAGE" : {
    "transaction" : "GET user-new PAGE",
    "sampleCount" : 31,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 47502.22580645162,
    "minResTime" : 16264.0,
    "maxResTime" : 62709.0,
    "pct1ResTime" : 61093.0,
    "pct2ResTime" : 62081.4,
    "pct3ResTime" : 62709.0,
    "throughput" : 0.04480785380498176,
    "receivedKBytesPerSec" : 0.7492710480376329,
    "sentKBytesPerSec" : 0.07339996213013647
  }
}